soap/uputstvo/SoapWebServisi.postman_collection.json

{
	"info": {
		"_postman_id": "7c7a8e3d-9e8f-4bca-a85d-fa00df0b4a8d",
		"name": "SoapWebServisi",
		"schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json"
	},
	"item": [
		{
			"name": "http://localhost:8555/studentservice",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"name": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:ser=\"http://service.megatravel.com/\">\r\n   <soapenv:Header/>\r\n   <soapenv:Body>\r\n      <ser:getStudent>\r\n         <arg0>8</arg0>\r\n      </ser:getStudent>\r\n   </soapenv:Body>\r\n</soapenv:Envelope>"
				},
				"url": {
					"raw": "http://localhost:8555/studentservice",
					"protocol": "http",
					"host": [
						"localhost"
					],
					"port": "8555",
					"path": [
						"studentservice"
					]
				}
			},
			"response": []
		},
		{
			"name": "http://localhost:8555/studentservice?wsdl",
			"request": {
				"method": "GET",
				"header": [],
				"url": {
					"raw": "http://localhost:8555/studentservice?wsdl",
					"protocol": "http",
					"host": [
						"localhost"
					],
					"port": "8555",
					"path": [
						"studentservice"
					],
					"query": [
						{
							"key": "wsdl",
							"value": null
						}
					]
				}
			},
			"response": []
		}
	]
}